/**  Математика и операторы сравнения */
let counter = -5;
console.log(counter);

console.log(2+2); //сложение
console.log(10-5); //вычитание
console.log(2*5); //умножение
console.log(20/10); //деление
console.log(2+2*2); //сложная конструкция, как в математике сначало будет умножение
console.log(2 ** 2); //возведение в степень 1 число это какое число возводим, 2 число это в какую степень
console.log(10 % 5); //остаток от деления 

/** Инкремент и дикремент */
let cupsofCoffe = 0;
//cupsofCoffe = cupsofCoffe + 1; // увеличить на 1
//cupsofCoffe += 1; // второй способ увеличения
//cupsofCoffe++; //третий способ (увеличивает на 1) ничего не прибавит
++cupsofCoffe; //четвертый способ (увеличивает на 1) прибавит 1
// этими же способами можно и уменьшать через символ "-"
console.log(cupsofCoffe);

let value = 5;
value = value * 5; //умножение
value *= 2; //умножение короткий способ

/** Операторы сравнения > < >= <= == === */
console.log(5 > 10);
console.log(5 < 10);
console.log(5 <= 5);
console.log(5 >= 6);
console.log(100 == 100);

/** Сравнение строк */
console.log('JavaScript' == 'Javascript');

/** == и ===
 == - сравнивает значение
 === - сравнивает типы
 * */





/** Логические конструкции */
/** Логические операторы */
/** Циклы */